### Pandas

In [1]:
!pip install pandas

Requirement already satisfied: pandas in f:\courses\ds,ml,dl,nlp\code\venv\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.22.4 in f:\courses\ds,ml,dl,nlp\code\venv\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in f:\courses\ds,ml,dl,nlp\code\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in f:\courses\ds,ml,dl,nlp\code\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in f:\courses\ds,ml,dl,nlp\code\venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in f:\courses\ds,ml,dl,nlp\code\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [3]:
# Series
# 1D array-like structure
s = pd.Series([1, 2, 3, 4, 5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
# Create a series with dictionary
s1=pd.Series({'Narendra':16,'Ayush':6,'Pranav':14})
print(s1)

Narendra    16
Ayush        6
Pranav      14
dtype: int64

In [5]:
data=[10,20,30]
index=['a','b','c']
s2=pd.Series(data,index=index)
print(s2)

a    10
b    20
c    30
dtype: int64

In [6]:
# DataFrame
Data={
    'Name':['Narendra','Ayush','Pranav'],
    'Age':[18,19,18],
    'City':['Parbhani','Washim','Jalgaon']
}
df=pd.DataFrame(Data)
print(df)
print(type(df))

       Name  Age      City
0  Narendra   18  Parbhani
1     Ayush   19    Washim
2    Pranav   18   Jalgaon
<class 'pandas.core.frame.DataFrame'>

In [7]:
import numpy as np
np.array(df)

array([['Narendra', 18, 'Parbhani'],
       ['Ayush', 19, 'Washim'],
       ['Pranav', 18, 'Jalgaon']], dtype=object)

In [8]:
# Create a Dataframe from a List of Dictionaries
dta1=[
    {'Name':'Narendra','Age':18,'City':'Parbhani'},
    {'Name':'Ayush','Age':19,'City':'Washim'},
    {'Name':'Pranav','Age':18,'City':'Jalgaon'}
]
pd.DataFrame(dta1)

       Name  Age      City
0  Narendra   18  Parbhani
1     Ayush   19    Washim
2    Pranav   18   Jalgaon

In [9]:
df=pd.read_csv('test.csv')
df.head(11) #Displays first 11 rows
df.tail(11) #Displays last 11 rows
print(df.shape) #Returns number of rows and columns
print(df.columns) #Returns column names
print(df.info()) #Returns information about the DataFrame
print(df.describe()) #Returns statistical summary of the DataFrame

(50, 3)
Index(['News Title', 'News Link', 'Verified Status'], dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   News Title       50 non-null     object
 1   News Link        50 non-null     object
 2   Verified Status  50 non-null     object
dtypes: object(3)
memory usage: 1.3+ KB
None
                                               News Title  \
count                                                  50
unique                                                 49
top     Entertainment venue management firm Legends In...
freq                                                    2

                                                News Link Verified Status
count                                                  50              50
unique                                                 50               1
top     https://securityaffairs.com/176725/malware/sec...        Verified
freq                                                    1              50

In [10]:
df=pd.DataFrame(Data)
print(df)
print(type(df))

       Name  Age      City
0  Narendra   18  Parbhani
1     Ayush   19    Washim
2    Pranav   18   Jalgaon
<class 'pandas.core.frame.DataFrame'>

In [11]:
# Access data from perticular DataFrame
df

       Name  Age      City
0  Narendra   18  Parbhani
1     Ayush   19    Washim
2    Pranav   18   Jalgaon

In [12]:
df['Name']

0    Narendra
1       Ayush
2      Pranav
Name: Name, dtype: object

In [13]:
print(df.iloc[0][2])  
print(df.iloc[1][2])  
print(df.iloc[2][1])
# iloc means index location, used for accessing rows and columns by index position

Parbhani
Washim
18

C:\Users\HP\AppData\Local\Temp\ipykernel_9996\1198164241.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[0][2])
C:\Users\HP\AppData\Local\Temp\ipykernel_9996\1198164241.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[1][2])
C:\Users\HP\AppData\Local\Temp\ipykernel_9996\1198164241.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.iloc[2][1])

In [14]:
# Access specific element
df.at[2,'Name']
df.iat[1,2]

'Washim'

In [15]:
# Data Manipulation
# Adding columns to DataFrame
df['Salary']=[100000,50000,60000]
df

       Name  Age      City  Salary
0  Narendra   18  Parbhani  100000
1     Ayush   19    Washim   50000
2    Pranav   18   Jalgaon   60000

In [16]:
# Dropping column
# temp 
df.drop('Salary',axis=1)
df

       Name  Age      City  Salary
0  Narendra   18  Parbhani  100000
1     Ayush   19    Washim   50000
2    Pranav   18   Jalgaon   60000

In [17]:
# permanant operation
df.drop('Salary',axis=1,inplace=True)
df

       Name  Age      City
0  Narendra   18  Parbhani
1     Ayush   19    Washim
2    Pranav   18   Jalgaon

In [18]:
df['Age']=df['Age']+1
df

       Name  Age      City
0  Narendra   19  Parbhani
1     Ayush   20    Washim
2    Pranav   19   Jalgaon